/**
 * Created by Administrator on 2017/1/10 0010.
 */
var dom = document.getElementById("mapchartDomMid");
var myChart = echarts.init(dom);
var app = {};
option = null;
var geoCoordMap = {
	'上海': [121.4648, 31.2891],
	'泰安': [117.0264, 36.0516],
	'南宁': [108.479, 23.1152],
	'柳州': [109.3799, 24.9774],
	'扬州': [119.4653, 32.8162],
	'金华': [120.0037, 29.1028],
	'江阴': [120.2915, 31.9260],

	'北京': [116.4551, 40.2539],
	'成都': [103.9526, 30.7617],
	'襄阳': [112.1273, 32.0170],
	'无锡': [120.3442, 31.5527],
	'温州': [120.498, 27.8119],
	'宁波': [121.5967, 29.6466],
	'杭州': [119.5313, 29.8773],
	'东阳': [120.2426, 29.2940],
	'嘉兴': [120.9155, 30.6354],
	'镇江': [119.4763, 31.9702],
	'高安': [115.3848, 28.4236],

	'广州': [113.5107, 23.2196],
	'武汉': [114.3896, 30.6628],
	'丰城': [115.7780, 28.1663],
	'嵊州': [120.8374, 29.5690],
	'张家口': [115.1477, 40.8527],
	'霍尔果斯': [80.4202, 44.2367],
	'湖州': [119.8608, 30.7782],
	'深圳': [114.5435, 22.5439],
	'佛山': [112.8955, 23.1097],
	'台州': [121.1353, 28.6688],
	'苏州': [120.6519, 31.3989],
	'湘潭': [112.5439, 27.7075],
	'铜陵': [117.8196, 30.9514],
	'宜昌': [111.2931, 30.6976],
	'福州': [119.4543, 25.9222],
	'济南': [117.1582, 36.8701],
	'东营': [118.7073, 37.5513],
	'西安': [109.1162, 34.2004],
	'廊坊': [116.521, 39.0509],
	'海口': [110.3893, 19.8516],
	'泸州': [105.4485, 28.8779],
	'日照': [119.2786, 35.5023],
	'滨州': [117.8174, 37.4963],
	'昆明': [102.9199, 25.4663],
	'随州': [113.3882, 31.6962],
	'济宁': [116.8286, 35.3375],
	'烟台': [120.7397, 37.5128],
	'潍坊': [119.0918, 36.524],
	'菏泽': [115.6201, 35.2057],
	'淄博': [118.0371, 36.6064],
	'威海': [121.9482, 37.1393],
	'枣庄': [117.323, 34.8926],
	'临沂': [118.3118, 35.2936],
	'青岛': [120.4651, 36.3373],
	'莱芜': [117.6526, 36.2714],
	'德州': [116.6858, 37.2107],
	'南京': [118.8062, 31.9208],
	'贵阳': [106.6992, 26.7682],
	'广安': [106.6372, 30.4629],
	'宜春': [114.4195, 27.8231],
	'浏阳': [113.6511, 28.1721],
	'德阳': [104.4061, 31.1358],
	'达州': [107.4717, 31.2145],
	'什邡': [104.1732, 31.1351],
	'樟树': [115.5506, 28.0629],
	'珠海': [113.7305, 22.1155],
	'眉山': [103.8588, 30.0842],
	'呼和浩特': [111.4124, 40.4901],
	'宜兴': [119.82931, 31.343204],
	'绍兴': [120.564, 29.7565],
	'江门': [112.6318, 22.1484],
	'重庆': [107.7539, 30.1904],
	'衢州': [118.6853, 28.8666],
	'泉州': [118.3228, 25.1147],
	'银川': [106.3586, 38.1775],
	'舟山': [122.2559, 30.2234],
	'鄂尔多斯': [108.9734, 39.2487],

	'东莞': [113.8953, 22.901],
	'中山': [113.4229, 22.478],
	'临汾': [111.4783, 36.1615],
	'丹东': [124.541, 40.4242],
	'丽水': [119.5642, 28.1854],
	'乌鲁木齐': [87.9236, 43.5883],
	'保定': [115.0488, 39.0948],
	'兰州': [103.5901, 36.3043],
	'包头': [110.3467, 41.4899],
	'北海': [109.314, 21.6211],
	'南昌': [116.0046, 28.6633],
	'南通': [121.1023, 32.1625],
	'厦门': [118.1689, 24.6478],
	'合肥': [117.29, 32.0581],
	'咸阳': [108.4131, 34.8706],
	'哈尔滨': [127.9688, 45.368],
	'唐山': [118.4766, 39.6826],
	'大同': [113.7854, 39.8035],
	'大连': [122.2229, 39.4409],
	'天津': [117.4219, 39.4189],
	'太原': [112.3352, 37.9413],
	'宝鸡': [107.1826, 34.3433],
	'宿迁': [118.5535, 33.7775],
	'常州': [119.4543, 31.5582],
	'延安': [109.1052, 36.4252],
	'徐州': [117.5208, 34.3268],
	'惠州': [114.6204, 23.1647],
	'承德': [117.5757, 41.4075],
	'拉萨': [91.1865, 30.1465],
	'株洲': [113.5327, 27.0319],
	'汕头': [117.1692, 23.3405],
	'沈阳': [123.1238, 42.1216],
	'沧州': [116.8286, 38.2104],
	'河源': [114.917, 23.9722],
	'泰州': [120.0586, 32.5525],
	'淮安': [118.927, 33.4039],
	'清远': [112.9175, 24.3292],
	'渭南': [109.7864, 35.0299],
	'玉溪': [101.9312, 23.8898],
	'盐城': [120.2234, 33.5577],
	'盘锦': [121.9482, 41.0449],
	'石家庄': [114.4995, 38.1006],
	'秦皇岛': [119.2126, 40.0232],
	'聊城': [115.9167, 36.4032],
	'肇庆': [112.1265, 23.5822],
	'营口': [122.4316, 40.4297],
	'葫芦岛': [120.1575, 40.578],
	'衡水': [115.8838, 37.7161],
	'西宁': [101.4038, 36.8207],
	'连云港': [119.1248, 34.552],
	'邢台': [114.8071, 37.2821],
	'邯郸': [114.4775, 36.535],
	'郑州': [113.4668, 34.6234],
	'铜川': [109.0393, 35.1947],
	'长春': [125.8154, 44.2584],
	'长沙': [113.0823, 28.2568],
	'长治': [112.8625, 36.4746],
	'阳泉': [113.4778, 38.0951],
	'韶关': [113.7964, 24.7028]
};

var BJData = [
	[{ name: '北京' }, { name: '上海', value: 95 }],
	[{ name: '北京' }, { name: '广州', value: 90 }],
	[{ name: '北京' }, { name: '西宁', value: 80 }],
	[{ name: '北京' }, { name: '南宁', value: 70 }],
	[{ name: '北京' }, { name: '南昌', value: 60 }],
	[{ name: '北京' }, { name: '拉萨', value: 50 }],
	[{ name: '北京' }, { name: '天津', value: 40 }],
	[{ name: '北京' }, { name: '乌鲁木齐', value: 30 }],
	[{ name: '北京' }, { name: '厦门', value: 20 }],
	[{ name: '北京' }, { name: '常州', value: 10 }]
];

var SHData = [
	[{ name: '上海' }, { name: '包头', value: 95 }],
	[{ name: '上海' }, { name: '昆明', value: 90 }],
	[{ name: '上海' }, { name: '广州', value: 80 }],
	[{ name: '上海' }, { name: '郑州', value: 70 }],
	[{ name: '上海' }, { name: '哈尔滨', value: 60 }],
	[{ name: '上海' }, { name: '重庆', value: 50 }],
	[{ name: '上海' }, { name: '长沙', value: 40 }],
	[{ name: '上海' }, { name: '北京', value: 30 }],
	[{ name: '上海' }, { name: '丹东', value: 20 }]
];

var GZData = [
	[{ name: '广州' }, { name: '福州', value: 95 }],
	[{ name: '广州' }, { name: '太原', value: 90 }],
	[{ name: '广州' }, { name: '长春', value: 80 }],
	[{ name: '广州' }, { name: '大同', value: 70 }],
	[{ name: '广州' }, { name: '西安', value: 60 }],
	[{ name: '广州' }, { name: '成都', value: 50 }],
	[{ name: '广州' }, { name: '常州', value: 40 }],
	[{ name: '广州' }, { name: '北京', value: 30 }],
	[{ name: '广州' }, { name: '北海', value: 20 }],
	[{ name: '广州' }, { name: '海口', value: 10 }]
];

var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';

var convertData = function(data) {
	var res = [];
	for(var i = 0; i < data.length; i++) {
		var dataItem = data[i];
		var fromCoord = geoCoordMap[dataItem[0].name];
		var toCoord = geoCoordMap[dataItem[1].name];
		if(fromCoord && toCoord) {
			res.push({
				fromName: dataItem[0].name,
				toName: dataItem[1].name,
				coords: [fromCoord, toCoord]
			});
		}
	}
	return res;
};

//var color = ['#a6c84c', '#ffa022', '#46bee9'];
var color = ['#4FC1E9', '#4FC1E9', '#4FC1E9'];
var series = [];
[
	['北京', BJData],
	['上海', SHData],
	['广州', GZData]
].forEach(function(item, i) {
	series.push({
		name: item[0] + ' Top10',
		type: 'lines',
		zlevel: 1,
		effect: {
			show: true,
			period: 6,
			trailLength: 0.7,
			color: '#BDE8FF',
			symbolSize: 6
		},
		lineStyle: {
			normal: {
				color: color[i],
				width: 0,
				curveness: 0.2
			}
		},
		data: convertData(item[1])
	}, {
		name: item[0] + ' Top10',
		type: 'lines',
		zlevel: 2,

		lineStyle: {
			normal: {
				color: color[i],
				width: 2,
				opacity: 0.2,
				curveness: 0.2
			}
		},
		data: convertData(item[1])
	}, {
		name: item[0] + ' Top10',
		type: 'effectScatter',
		coordinateSystem: 'geo',
		zlevel: 2,
		rippleEffect: {
			brushType: 'stroke'
		},
		label: {
			normal: {
				show: true,
				position: 'right',
				formatter: '{b}'
			}
		},
		symbolSize: function(val) {
			return val[2] / 8;
		},
		itemStyle: {
			normal: {
				color: color[i]
			}
		},
		data: item[1].map(function(dataItem) {
			return {
				name: dataItem[1].name,
				value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
			};
		})
	});
});

option = {
	backgroundColor: 'transparent',
	title: {
		text: '',
		left: 'center',
		textStyle: {
			color: '#fff'
		}
	},
	tooltip: {
		trigger: 'item'
	},
	legend: {
		orient: 'vertical',
		top: 'bottom',
		left: 'right',
		//data:['北京 Top10', '上海 Top10', '广州 Top10'],
		textStyle: {
			color: '#fff'
		},
		selectedMode: 'single'
	},
	geo: {
		map: 'china',
		label: {
			emphasis: {
				show: false
			}
		},
		roam: true,
		itemStyle: {
			normal: { //选取前颜色
				areaColor: 'rgba(79,193,233,0.15)',
				borderColor: '#4FC1E9',
				borderWidth: 2
			},
			emphasis: { //选取后颜色
				areaColor: 'black'
			}
		}
	},
	series: series
};;
if(option && typeof option === "object") {
	myChart.setOption(option, true);
}